hannah_greenwell/week5/world-leaders-2-models/app/views/users/new.html.erb

    <%= f.label :country_id, 'Country' %>
    <%= f.collection_select :country_id, Country.all, :id, :name, prompt: 'Please choose a country' %>
---
SELECT "countries".* FROM "countries"