hannah_greenwell/week5/world-leaders-2-models/app/controllers/countries_controller.rb

  def create
    Country.create country_params
---
INSERT INTO "countries" ("name", "capital", "area", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def edit
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def update
    @country = Country.find params[:id]
    @country.update(country_params)
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "countries" SET "area" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["area", 9833520], ["updated_at", "2018-10-10 10:14:19.397372"], ["id", 10]]

  def destroy
    country = Country.find params[:id]
    country.destroy
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 10]]