hannah_greenwell/week5/world-leaders-2-models/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "country_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create user_params

UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "https://i2.wp.com/tvtonight.com.au/wp-content/uploads/alf-1.jpg"], ["updated_at", "2018-10-11 10:47:36.217029"], ["id", 5]]
---
  def update
    @current_user.update user_params

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
---
  def destroy
    @current_user.destroy