hannah_greenwell/week5/world-leaders-2-models/app/controllers/world_leaders_controller.rb

INSERT INTO "world_leaders" ("name", "years_in_office", "alive", "image", "quote", "country_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    WorldLeader.create world_leader_params

SELECT "world_leaders".* FROM "world_leaders"
---
  def index
    @world_leaders = WorldLeader.all

SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def show
    @world_leader = WorldLeader.find params[:id]

SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def edit
    @world_leader = WorldLeader.find params[:id]

SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "world_leaders" SET "country_id" = ?, "updated_at" = ? WHERE "world_leaders"."id" = ?  [["country_id", 28], ["updated_at", "2018-10-11 11:01:07.077007"], ["id", 21]]
---
  def update
    world_leader = WorldLeader.find params[:id]
    world_leader.update world_leader_params