hannah_greenwell/week5/world-leaders-2-models/app/views/countries/show.html.erb

<ul>
  <% @country.world_leaders.each do |leader| %>
---
SELECT "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."country_id" = ?  [["country_id", 6]]

<ul>
  <% @country.users.each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."country_id" = ?  [["country_id", 28]]