hannah_greenwell/week5/world-leaders-2-models/app/views/world_leaders/_form.html.erb

SELECT "countries".* FROM "countries"
---
    <%= f.label :country_id, 'Country' %>
    <%= f.collection_select :country_id, Country.all, :id, :name, prompt: 'Please choose a country' %>